<!DOCTYPE html>
<html>
<head>
    <link rel="stylesheet" href="../styles.css">
</head>
<body>
<?php
session_start();
$is_user_auth = $_SESSION['loggedin'];
$user_role = $_SESSION['user_role'];
if ($is_user_auth == 0 or $user_role != 'staff') header("Location: index.php");
?>

<p><a href="staff__1_perelick_firm.php">1, 11, 16 Отримати перелік і загальне число фірм, що забронювали місця в обсязі, не менше вказаного, за весь період співпраці, або за деякий період.</a></p>
<p><a href="staff__2_perelick_postoyaltsiv.php">2	Отримати перелік і загальне число постояльців, що заселяли в номери із зазначеними характеристиками за певний період. </a></p>
<p><a href="staff__4_amount_of_free_rooms.php">3,4 Отримати відомості про кількість вільних номерів </a></p>
<p><a href="staff__6_spisok_nomeriv.php">6	Отримати список зайнятих зараз номерів, які звільняються до зазначеного терміну </a></p>
<p><a href="staff__15_info_about_room.php">5, 15 Отримати відомості про конкретний номер: ким він був зайнятий в певний період.</a></p>
<p><a href="staff__7_fima_orders_rooms.php">7.	Отримати дані про обсяг бронювання номерів даною фірмою за вказаний період, і якими номерами віддавалися переваги. </a></p>
<p><a href="staff__9_room_profit.php">9 Отримати дані про рентабельність номерів з певними характеристиками: співвідношення про обсяг продажів номерів до накладних витрат за вказаний період. </a></p>
<p><a href="staff__10_vidomosti_pro_postoyaltsa.php">10, 14 Отримати відомості про постояльця із заданого номера: його рахунок готелю за додаткові послуги, які надходили від нього скарги, види додаткових послуг, якими він користувався.  </a></p>
<p><a href="staff__13_new_clients.php">13	Отримати відомості про нових клієнтів за вказаний період.  </a></p>
<p><a href="staff__12_postoyaltsi_vidviduyut_hotel.php">12	Отримати відомості про постояльців, які більше за всіх відвідують готель по всім корпусам готелів, по певним будівлям. </a></p>

<p><a href="index.php">GO TO THE MAIN PAGE</a></p>
</body>
</html>
